#include <iostream>
#include "matrix_processing.cpp"
#include "solving_geometric_tasks.cpp"
#include "sorting_tasks.cpp"

int main()
{
    printf_s("Hello World!");
}

// 1. Обработка матриц
// >>> 1. Запустить программу
// >>> >>> 1. Сформировать матрицу случайным образом
// >>> >>> 2. Сформировать матрицу вводом с клавиатуры
// >>> >>> 3. Сформировать матрицу вводом из файла
// >>> >>> 4. Вернуться назад
// >>> >>> 0. Завершить работу программы
// >>> 2. Справка о вариенте и задании
// >>> >>> 1. Вернуться назад
// >>> >>> 0. Завершить работу программы
// >>> 3. Вернуться назад
// >>> 0. Завершить работу программы
// 
// 2. Решение геометрических задач
// >>> 1. Запустить программу
// >>> >>> 1. Сформировать координаты точек случайным образом
// >>> >>> 2. Сформировать координаты точек вводом с клавиатуры
// >>> >>> 3. Сформировать координаты точек вводом из файла
// >>> >>> 4. Вернуться назад
// >>> >>> 0. Завершить работу программы
// >>> 2. Справка о вариенте и задании
// >>> >>> 1. Вернуться назад
// >>> >>> 0. Завершить работу программы
// >>> 3. Вернуться назад
// >>> 0. Завершить работу программы
// 
// 3. Задачи сортировки
// >>> 1. Запустить программу
// >>> >>> 1. Сформировать массив случайным образом
// >>> >>> 2. Сформировать массив вводом с клавиатуры
// >>> >>> 3. Сформировать массив вводом из файла
// >>> >>> 4. Вернуться назад
// >>> >>> 0. Завершить работу программы
// >>> 2. Справка о вариенте и задании
// >>> >>> 1. Вернуться назад
// >>> >>> 0. Завершить работу программы
// >>> 3. Вернуться назад
// >>> 0. Завершить работу программы
// 0. Завершить работу программы